tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
    Esp32BaseRecordStore::RecordStartTime startTime;
    const bool captured = wateringRecordStore_.captureStartTime(startTime);
    const WateringStartResult result = wateringController_.start(request, *config, millis());
    if (result == WateringStartResult::Started) {
        wateringStartTime_ = startTime;
        wateringStartTimeValid_ = captured;
    }
    return result;
}

WateringStartResult IrrigationApp::startManualWatering(
    const std::array<uint16_t, BoardPins::kZoneCount>& zoneDurationMinutes) {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return WateringStartResult::NotReady;
    }
    WateringRequest request{};
    request.source = WateringSource::ManualZones;
    request.purpose = WateringPurpose::Normal;
    for (uint8_t index = 0; index < config->zones.size(); ++index) {
        if (zoneDurationMinutes[index] == 0) {
            continue;
        }
        if (!config->zones[index].enabled || zoneDurationMinutes[index] > 120) {
            return WateringStartResult::InvalidRequest;
        }
        request.steps[request.stepCount++] = {
            config->zones[index].id,
            static_cast<uint32_t>(zoneDurationMinutes[index]) * 60U,
        };
    }
    return startWatering(request);
}

bool IrrigationApp::stopWatering() {
    return businessReady_ && wateringController_.stop(millis());
}

WateringStatus IrrigationApp::wateringStatus() const {
    return wateringController_.status();
}

FlowHistorySnapshot IrrigationApp::wateringFlowHistory() const {
    return wateringController_.flowHistory();
}

bool IrrigationApp::readLatestWateringRecords(uint32_t offset,
                                              uint32_t limit,
                                              WateringRecordStore::ReadCallback callback,
                                              void* user) {
    return wateringRecordStore_.readLatest(offset, limit, callback, user);
}

Esp32BaseRecordStore::RecordReadResult IrrigationApp::readWateringRecordById(
    uint32_t recordId,
    StoredWateringRecord& record) {
    return wateringRecordStore_.readById(recordId, record);
}

bool IrrigationApp::readWateringRecordStoreStatus(
    Esp32BaseRecordStore::StoreStatus& status) const {
    return wateringRecordStore_.readStatus(status);
}

bool IrrigationApp::readLatestEvents(uint32_t offset,
                                     uint32_t limit,
                                     IrrigationEvents::ReadCallback callback,
                                     void* user) const {
    return events_.readLatest(offset, limit, callback, user);
}

bool IrrigationApp::readEventStatus(Esp32BaseAppEvents::AppEventsStatus& status) const {
    return events_.readStatus(status);
}

bool IrrigationApp::recordStorageFault() const {
    return recordStorageFault_;
}

bool IrrigationApp::eventStorageFault() const {
    return events_.storageFault();
}

bool IrrigationApp::schedulerStorageFault() const {
    return schedulerStorageFault_;
}

bool IrrigationApp::checkpointStorageFault() const {
    return aliveCheckpoint_.storageFault();
}

uint32_t IrrigationApp::lastKnownAliveEpoch() const {
    return aliveCheckpoint_.lastKnownAliveEpoch();
}

bool IrrigationApp::unexpectedFlowAlarm() const {
    return unexpectedFlowMonitor_.alarmActive();
}

bool IrrigationApp::unexpectedFlowObservationReady() const {
    return unexpectedFlowMonitor_.observationReady(millis());
}

uint32_t IrrigationApp::unexpectedFlowObservedPulseCount() const {
    return unexpectedFlowMonitor_.observedPulseCount();
}

AutomaticWateringState IrrigationApp::automaticWateringState() const {
    return wateringScheduler_.automaticState();
}

NextAutomaticWatering IrrigationApp::nextAutomaticWatering() const {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return {NextAutomaticWateringStatus::TimeUnavailable, 0, 0};
    }
    return wateringScheduler_.nextAutomaticWatering(
        *config, Esp32BaseTime::snapshot().epochSec);
}

WateringScheduler::TimeState IrrigationApp::schedulerTimeState() const {
    return wateringScheduler_.timeState();
}

bool IrrigationApp::pauseAutomaticWateringIndefinitely() {
    return businessReady_ && wateringScheduler_.pauseIndefinitely();
}

bool IrrigationApp::pauseAutomaticWateringUntil(uint32_t resumeAtEpoch) {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    return businessReady_ && wateringScheduler_.pauseUntil(resumeAtEpoch,
                                                           now.synced &&
                                                               wateringScheduler_.timeState() ==
                                                                   WateringScheduler::TimeState::Ready,
                                                           now.epochSec);
}

bool IrrigationApp::resumeAutomaticWatering() {
    return businessReady_ && wateringScheduler_.resumeManually();
}

WateringStartResult IrrigationApp::startFlowCalibration(
    uint8_t zoneId,
    uint16_t maximumDurationMinutes) {
    if (flowCalibrationService_.hasPendingMeasurement() ||
        flowCalibrationService_.sampleCount() >= FlowCalibrationService::kMaximumSamples ||
        !BoardPins::isValidZoneId(zoneId) || maximumDurationMinutes == 0 ||
        maximumDurationMinutes > 10) {
        return WateringStartResult::InvalidRequest;
    }
    WateringRequest request{};
    request.source = WateringSource::ManualZones;
    request.purpose = WateringPurpose::FlowCalibration;
    request.stepCount = 1;
    request.steps[0] = {zoneId, static_cast<uint32_t>(maximumDurationMinutes) * 60U};
    return startWatering(request);
}

bool IrrigationApp::submitFlowCalibrationMeasurement(uint32_t measuredWaterMl) {
    return businessReady_ && !wateringController_.status().active &&
           flowCalibrationService_.addPendingMeasurement(measuredWaterMl, trustedEpoch());
}

bool IrrigationApp::markFlowCalibrationSampleInvalid() {
    return businessReady_ && !wateringController_.status().active &&
           flowCalibrationService_.markPendingInvalid();
}

bool IrrigationApp::updateFlowCalibrationMeasurement(uint8_t index,
                                                     uint32_t measuredWaterMl) {
    return businessReady_ && !wateringController_.status().active &&
           flowCalibrationService_.updateMeasurement(index, measuredWaterMl, trustedEpoch());
}

bool IrrigationApp::deleteFlowCalibrationSample(uint8_t index) {
    return businessReady_ && !wateringController_.status().active &&
           flowCalibrationService_.deleteSample(index, trustedEpoch());
}

bool IrrigationApp::applyFlowCalibrationResult() {
    const uint32_t coefficient = flowCalibrationService_.combinedPulsesPerLiterX100();
    if (!businessReady_ || wateringController_.status().active ||
        flowCalibrationService_.hasPendingMeasurement() ||
        !flowCalibrationService_.resultReady() || coefficient == 0) {
        return false;
    }
    FlowMeterConfig parameters{};
    parameters.pulsesPerLiterX100 = coefficient;
    parameters.calibrationStartupPulseCount =
        flowCalibrationService_.combinedStartupPulseCount();
    parameters.calibrationStartupWaterMl =
        flowCalibrationService_.combinedStartupWaterMl();
    if (!saveFlowCalibrationParameters(parameters)) {
        return false;
    }
    flowCalibrationService_.markResultApplied(trustedEpoch(), coefficient);
    return true;
}

bool IrrigationApp::saveFlowCalibrationParameters(
    const FlowMeterConfig& parameters) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || wateringController_.status().active || !current ||
        flowCalibrationService_.hasPendingMeasurement()) {
        return false;
    }
    if (current->flowMeter.pulsesPerLiterX100 == parameters.pulsesPerLiterX100 &&
        current->flowMeter.calibrationStartupPulseCount ==
            parameters.calibrationStartupPulseCount &&
        current->flowMeter.calibrationStartupWaterMl ==
            parameters.calibrationStartupWaterMl) {
        return true;
    }
    const bool parametersSaved =
        IrrigationParameterConfig::saveFlowCalibrationParameters(parameters);
    if (!parametersSaved || !applyStoredParameterConfig()) {
        return false;
    }
    wateringScheduler_.rebaseTimeCheck();
    resetUnexpectedFlowMonitor(millis());
    events_.recordFlowCalibrationSaved(parameters.pulsesPerLiterX100);
    return true;
}

void IrrigationApp::resetFlowCalibration() {
    if (!wateringController_.status().active) {
        flowCalibrationService_.clear();
    }
}

const FlowCalibrationService& IrrigationApp::flowCalibration() const {
    return flowCalibrationService_;
}

WateringStartResult IrrigationApp::startZoneFlowLearning(uint8_t zoneId) {
    if (pendingLearnedZoneId_ != 0 || !BoardPins::isValidZoneId(zoneId)) {
        return WateringStartResult::InvalidRequest;
    }
    WateringRequest request{};
    request.source = WateringSource::ManualZones;
    request.purpose = WateringPurpose::ZoneFlowLearning;
    request.stepCount = 1;
    request.steps[0] = {zoneId, 10U * 60U};
    return startWatering(request);
}

